/*
 * @------------------------------------------1: 1------------------------------------------@
 * @Author: lee-shun
 * @Email: 2015097272@qq.com
 * @Date: 2020-02-19 11:28:44
 * @Organization: BIT-CGNC, fixed_wing_group
 * @Description:  
 * @------------------------------------------2: 2------------------------------------------@
 * @LastEditors: lee-shun
 * @LastEditors_Email: 2015097272@qq.com
 * @LastEditTime: 2020-02-19 20:40:53
 * @LastEditors_Organization: BIT-CGNC, fixed_wing_group
 * @LastEditors_Description:  
 * 本程序是一个状态机，管理飞机比赛任务切换问题，订阅来自监
 * 控节点的监控消息，获取飞机的四个阶段的执行状况；根据飞机
 * 当前的状态以及任务的需要，产生飞机期望模式msg，交由
 * task_main使用
 * @------------------------------------------3: 3------------------------------------------@
 */
