%=================================================================================
%本仿真程序的作用是竖直平面的控制器的仿真程序
%
%           （期望速度+期望高度）-->TECS控制器-->(期望油门（推力）+期望俯仰角）
%                  ^|^                                |              |
%                   |                     ---<-----<--|              |
%                   |                     |                          |
%             （质心运动学）-<-（飞行力学质心动力学第一式）<--姿态内环<--|
%
%=================================================================================

clear;
clc;

%===
%===变量定义初始化
%===

%类宏定义
GROUP_LENGTH=50;
GRAVITY_CONSTANT=9.81;

%==
%==仿真时间
%==
time_stamp = 0; %时间戳，整数增加，用来数组索引
TIME = zeros(1, GROUP_LENGTH); %时间队列
now = 0.0; %当前时间
d_t = 0.05; %时间间隔
end_time = 30; %终止时间

%==
%==领机
%==
led_high=zeros(1, GROUP_LENGTH);
led_high(1)=100;

%==
%==从机
%==
%高度
fol_high=zeros(1, GROUP_LENGTH);
fol_high(1)=10;

%速度
fol_vel=zeros(1, GROUP_LENGTH);
fol_vel(1)=10;

%俯仰角(弧度）
fol_thetazeros(1, GROUP_LENGTH);
fol_vel(1)=0;

%==
%==期望值
%==
%速度期望值
fol_vel_sp=20;

%高度期望值
fol_high_sp=zeros(1, GROUP_LENGTH);
fol_high_sp(1)=led_high(1);

%==
%==控制器
%==

thrust_sp=zeros(1, GROUP_LENGTH);%期望推力
theta_sp=zeros(1, GROUP_LENGTH);%期望俯仰角

%==
%==飞机模型参数
%==
m=2.0;%质量kg
T_max=4.0*GRAVITY_CONSTANT;%最大推力N（即4.0kg拉力）
C_d=0.02;%阻力系数
rou=1.225;%空气密度

%==
%==仿真主循环
%==

for now=0.0:d_t:end_time

    %==
    %==1:计算期望值
    %==

    %==
    %==2:进入TECS控制器（其中，TECS控制器的输入为：（当前高度、期望高度、当前空速、当前俯仰角、期望空速）；输出为（期望俯仰角、期望推力比例（0.0-1.0）））
    %==
    
    %==
    %==3:获得下一时刻的俯仰角，速度等信息
    %==
    
    %==
    %==4:更新速度更新位置
    %==

    
end
